# PostgreSQL

In [113]:
import psycopg2
import pandas as pd

In [123]:
try:
    connection = psycopg2.connect(host="localhost", 
                                  port = 5432,
                                  database='mydb',
                                  user="postgres",
                                  password="postgres")
except:
    print("I am unable to connect to the database")

In [124]:
cursor = connection.cursor()

In [125]:
cursor.execute("DROP TABLE IF EXISTS attribute")

cursor.execute("""CREATE TABLE attribute
                (id INT PRIMARY KEY, 
                 attribute VARCHAR(255))""")
connection.commit()

In [126]:
cursor.execute("""SELECT table_name FROM information_schema.tables
       WHERE table_schema = 'public'""")
for table in cursor.fetchall():
    print(table)

('attribute',)

In [131]:
df = pd.read_csv('attribute.csv')
df.head(3)

   Unnamed: 0  id     Attribute   #  Avail Avg Sale Cheapest
0           0   0        Beanie  44     11  380.50Ξ     360Ξ
1           1   1        Choker  48     13     152Ξ  119.95Ξ
2           2   2  Pilot Helmet  54     12        0     190Ξ

In [128]:
sql = "INSERT INTO attribute (id, attribute) VALUES (%s,%s)"

#tuple and than list
df['att'] = df[['id', 'Attribute']].apply(tuple, axis=1)
att = list(df['att'])

cursor.executemany(sql, att)
connection.commit()
print(cursor.rowcount, "record inserted")

87 record inserted

In [129]:
cursor.close()
connection.close()

# MySQL

In [137]:
import pymysql
import pandas as pd

In [138]:
try:
    connection = pymysql.connect(host='localhost',
                                 user='root',
                                 password='mysql')
except:
    print("I am unable to connect to the database")

In [139]:
cursor = connection.cursor()
cursor.execute("DROP DATABASE IF EXISTS mydb")
cursor.execute("CREATE DATABASE mydb")
cursor.execute("USE mydb")

0

In [140]:
cursor.execute("DROP TABLE IF EXISTS attribute")

cursor.execute("""CREATE TABLE attribute
                (id INT PRIMARY KEY, 
                 attribute VARCHAR(255))""")
cursor.execute("SHOW TABLES")
for x in cursor:
    print(x)

('attribute',)

In [141]:
df = pd.read_csv('attribute.csv')

In [142]:
sql = "INSERT INTO attribute (id, attribute) VALUES (%s,%s)"

#tuple and than list
df['att'] = df[['id', 'Attribute']].apply(tuple, axis=1)
att = list(df['att'])

cursor.executemany(sql, att)
connection.commit()
print(cursor.rowcount, "record inserted")

87 record inserted

In [143]:
cursor.execute("DROP TABLE IF EXISTS type")

cursor.execute("""CREATE TABLE type
                (id INT PRIMARY KEY, 
                 category VARCHAR(255))""")
cursor.execute("SHOW TABLES")
for x in cursor:
    print(x)

('attribute',)
('type',)

In [144]:
sql = "INSERT INTO type (id, category) VALUES (%s,%s)"

types = [(0, 'Alien'),(1, 'Ape'),(2, 'Zombie'),(3, 'Female'),(4, 'Male')]

cursor.executemany(sql, types)
connection.commit()
print(cursor.rowcount, "record inserted")

5 record inserted

In [145]:
cursor.execute("DROP TABLE IF EXISTS skin")

cursor.execute("""CREATE TABLE skin
                (id INT PRIMARY KEY, 
                 skin VARCHAR(255))""")
cursor.execute("SHOW TABLES")
for x in cursor:
    print(x)

('attribute',)
('skin',)
('type',)

In [146]:
sql = "INSERT INTO skin (id, skin) VALUES (%s,%s)"

val = [(0, 'Alien'),(1, 'Ape'),(2, 'Zombie'),(3, 'Albino'),(4, 'Dark'),(5, 'Light'),(6, 'Mid')]

cursor.executemany(sql, val)
connection.commit()
print(cursor.rowcount, "record inserted")

7 record inserted

In [147]:
cursor.execute("DROP TABLE IF EXISTS punk")

cursor.execute("""CREATE TABLE punk
                (id INT PRIMARY KEY, 
                 url VARCHAR(255),
                 rarest_rank INT,
                 type_id INT ,
                 skin_id INT )""")

cursor.execute("SHOW TABLES")
for x in cursor:
    print(x)

('attribute',)
('punk',)
('skin',)
('type',)

In [148]:
df = pd.read_csv('punk.csv')

In [149]:
sql = "INSERT INTO punk (id, url, rarest_rank, type_id, skin_id) VALUES (%s,%s,%s,%s,%s)"

#tuple and than list
df['punk_all'] = df[['id','url', 'ranking','type','skin']].apply(tuple, axis=1)
val = list(df['punk_all'])

cursor.executemany(sql, val)
connection.commit()
print(cursor.rowcount, "record inserted")

10000 record inserted

In [150]:
cursor.execute("""ALTER TABLE punk ADD FOREIGN KEY (type_id) REFERENCES type(id)""")
cursor.execute("""ALTER TABLE punk ADD FOREIGN KEY (skin_id) REFERENCES skin(id)""")

10000

In [151]:
cursor.execute("DROP TABLE IF EXISTS punk_attribute_relation")

cursor.execute("""CREATE TABLE punk_attribute_relation
                (punk_id INT,
                 attribute_id INT)""")
cursor.execute("SHOW TABLES")
for x in cursor:
    print(x)

('attribute',)
('punk',)
('punk_attribute_relation',)
('skin',)
('type',)

In [152]:
df = pd.read_csv('punk_attribute_relation.csv')

In [153]:
sql = "INSERT INTO punk_attribute_relation (punk_id, attribute_id) VALUES (%s,%s)"

#tuple and than list
df['punk_att_all'] = df[['punk_id','att_id']].apply(tuple, axis=1)
val = list(df['punk_att_all'])

cursor.executemany(sql, val)
connection.commit()
print(cursor.rowcount, "record inserted")

27539 record inserted

In [154]:
cursor.execute("""ALTER TABLE punk_attribute_relation ADD FOREIGN KEY (punk_id) REFERENCES punk(id) ON UPDATE CASCADE""")
cursor.execute("""ALTER TABLE punk_attribute_relation ADD FOREIGN KEY (attribute_id) REFERENCES attribute(id) ON UPDATE CASCADE""")

27539

In [155]:
cursor.execute("DROP TABLE IF EXISTS transaction")

cursor.execute("""CREATE TABLE transaction
                (id INT PRIMARY KEY,
                 type VARCHAR(255),
                 date DATE,
                 amount FLOAT,
                 punk_id INT)""")
cursor.execute("SHOW TABLES")
for x in cursor:
    print(x)

('attribute',)
('punk',)
('punk_attribute_relation',)
('skin',)
('transaction',)
('type',)

In [156]:
df = pd.read_csv('transaction.csv')

In [157]:
sql = "INSERT INTO transaction (id, type, date, amount, punk_id) VALUES (%s,%s,%s,%s,%s)"

#tuple and than list
df['all'] = df[['id','type','date','amount','punk_id']].apply(tuple, axis=1)
val = list(df['all'])

cursor.executemany(sql, val)
connection.commit()
print(cursor.rowcount, "record inserted")

177692 record inserted

In [158]:
cursor.execute("""ALTER TABLE transaction ADD FOREIGN KEY (punk_id) REFERENCES punk(id) ON UPDATE CASCADE""")

177692

In [159]:
cursor.close()